---
kind: enumMember
id: F:Autodesk.Revit.DB.ExternalResourceLoadStatus.ResourceAlreadyCurrent
enum: Autodesk.Revit.DB.ExternalResourceLoadStatus
source: html/2f8c9146-6ae2-49a7-0a8b-cd544077602e.htm
---
# Autodesk.Revit.DB.ExternalResourceLoadStatus.ResourceAlreadyCurrent

The current version of the resource is already loaded into Revit so no changes were made to the model.